In [4]:
import pandas as pd
import numpy as np
import re

### Read in Original Dataset
Source: https://www.kaggle.com/residentmario/iowa-liquor-sales?select=Iowa_Liquor_Sales.csv

In [3]:
data=pd.read_csv('../Iowa_Liquor_Sales.csv') 
#b/c the file is too big to fit into the git repo put the data in the previous folder as where your repo is
#for example: the file path to my repo: C:\Users\brayd\Box Sync\Spring 2021 UIUC\ACE592_group
#PUT THE DATA HERE: C:\Users\brayd\Box Sync\Spring 2021 UIUC

In [5]:
data.head()

,Invoice/Item Number,Date,Store Number,Store Name,Address,City,Zip Code,Store Location,County Number,County,...,Item Number,Item Description,Pack,Bottle Volume (ml),State Bottle Cost,State Bottle Retail,Bottles Sold,Sale (Dollars),Volume Sold (Liters),Volume Sold (Gallons)
0,S29198800001,11/20/2015,2191,Keokuk Spirits,1013 MAIN,KEOKUK,52632,"1013 MAIN\nKEOKUK 52632\n(40.39978, -91.387531)",56.0,Lee,...,297,Templeton Rye w/Flask,6,750,$18.09,$27.14,6,$162.84,4.50,1.19
1,S29195400002,11/21/2015,2205,Ding's Honk And Holler,900 E WASHINGTON,CLARINDA,51632,"900 E WASHINGTON\nCLARINDA 51632\n(40.739238, ...",73.0,Page,...,297,Templeton Rye w/Flask,6,750,$18.09,$27.14,12,$325.68,9.00,2.38
2,S29050300001,11/16/2015,3549,Quicker Liquor Store,1414 48TH ST,FORT MADISON,52627,"1414 48TH ST\nFORT MADISON 52627\n(40.624226, ...",56.0,Lee,...,249,Disaronno Amaretto Cavalli Mignon 3-50ml Pack,20,150,$6.40,$9.60,2,$19.20,0.30,0.08
3,S28867700001,11/04/2015,2513,Hy-Vee Food Store #2 / Iowa City,812 S 1ST AVE,IOWA CITY,52240,812 S 1ST AVE\nIOWA CITY 52240\n,52.0,Johnson,...,237,Knob Creek w/ Crystal Decanter,3,1750,$35.55,$53.34,3,$160.02,5.25,1.39
4,S29050800001,11/17/2015,3942,Twin Town Liquor,104 HIGHWAY 30 WEST,TOLEDO,52342,"104 HIGHWAY 30 WEST\nTOLEDO 52342\n(41.985887,...",86.0,Tama,...,249,Disaronno Amaretto Cavalli Mignon 3-50ml Pack,20,150,$6.40,$9.60,2,$19.20,0.30,0.08

### Original dataset has over 12.5 million readings. We cut down the size of the original dataset by refining our timeframe and removing undesired columns of data

In [6]:
len(data) #number of observations

12591077

### Convert date to "datetime" type and sort original dataset by date

In [7]:
data['Date'] = pd.to_datetime(data['Date']) #convert 'Date' column to datetime type

In [8]:
data = data.sort_values(by="Date") #sort dates in chronological order

### Remove all data before January 1, 2014

In [9]:
cleaned_data = data[~(data['Date'] < '2014-01-01')] #subset data to only dates after 2014

In [10]:
cleaned_data.head()

,Invoice/Item Number,Date,Store Number,Store Name,Address,City,Zip Code,Store Location,County Number,County,...,Item Number,Item Description,Pack,Bottle Volume (ml),State Bottle Cost,State Bottle Retail,Bottles Sold,Sale (Dollars),Volume Sold (Liters),Volume Sold (Gallons)
6761203,S16635300023,2014-01-02,2448,Bottle Boutique,705 E. SECOND,INDIANOLA,50125,"705 E. SECOND\nINDIANOLA 50125\n(41.358191, -9...",91.0,Warren,...,15940,Tullamore Dew Irish Whisky,12,750,$13.60,$20.39,1,$20.39,0.75,0.20
5368674,S16625000025,2014-01-02,2248,Ingersoll Liquor and Beverage,3500 INGERSOLL AVE,DES MOINES,50312,3500 INGERSOLL AVE\nDES MOINES 50312\n(41.5863...,77.0,Polk,...,42166,Myers's Rum Original Dark,12,750,$10.00,$14.99,3,$44.97,2.25,0.59
3846964,S16634200035,2014-01-02,3785,Southside Tobacco and Liquor,2424 SW 9TH ST,DES MOINES,50315,"2424 SW 9TH ST\nDES MOINES 50315\n(41.56373, -...",77.0,Polk,...,45887,Sailor Jerry Spiced Navy Rum,12,1000,$11.20,$16.79,1,$16.79,1.00,0.26
2255583,S16640300091,2014-01-02,4344,Spirits / Grimes,109 EAST 1ST ST STE B,GRIMES,50111,"109 EAST 1ST ST STE B\nGRIMES 50111\n(41.6884,...",77.0,Polk,...,87510,1800 Silver Tequila,12,750,$14.50,$21.74,1,$21.74,0.75,0.20
5144101,S16630700062,2014-01-02,2561,Hy-Vee Food Store / Fleur / DSM,4605 FLEUR DRIVE,DES MOINES,50321,4605 FLEUR DRIVE\nDES MOINES 50321\n(41.542816...,77.0,Polk,...,4796,Cutty Sark Scotch,12,750,$11.90,$17.85,4,$71.40,3.00,0.79

## Working on correct number of counties and filling in NaN values

In [12]:
cleaned_data.loc[:,('County')]=cleaned_data['County'].str.lower() #lower county and city names as to make aggregating over them more easy
cleaned_data.loc[:,('City')]=cleaned_data['City'].str.lower()

In [13]:
#does the number of unique county names in our dataset equal the numer of counties in Iowa?
print(99==cleaned_data['County'].nunique())

False

In [14]:
#How many unique county names are we getting? 
cleaned_data['County'].nunique()

103

In [15]:
cleaned_data['County'].unique()
#there are some duplicates: e.g. buena vista and buena vist
#also o'brien and obrien
#also another entry pottawatta should be pottawattamie
#also NaN counties??
#PROBLEM: more counties in dataset than there are in Iowa

array(['warren', 'polk', 'black hawk', 'johnson', 'crawford', 'linn',
       'clinton', 'carroll', 'jasper', 'dallas', 'cedar', 'marion',
       'jones', 'lucas', 'wayne', 'cerro gordo', 'iowa', 'decatur',
       'hamilton', 'greene', 'clarke', 'boone', 'allamakee', 'ida',
       'pottawattamie', 'lee', 'henry', 'des moines', 'grundy',
       'van buren', 'cass', 'muscatine', 'wapello', 'scott', 'delaware',
       'harrison', 'dubuque', 'jackson', 'buchanan', 'shelby',
       'washington', 'hardin', 'jefferson', 'franklin', 'louisa',
       'audubon', 'story', 'butler', 'clayton', 'adair', 'worth',
       'keokuk', 'guthrie', 'benton', 'fayette', 'webster', 'winnebago',
       'palo alto', 'poweshiek', 'clay', 'dickinson', 'plymouth',
       'marshall', 'howard', 'cherokee', 'sioux', 'osceola', 'montgomery',
       'mitchell', 'lyon', 'union', 'wright', "o'brien", 'floyd', 'tama',
       'pocahontas', 'mills', 'page', 'bremer', 'emmet', 'humboldt',
       'chickasaw', 'madison', 'taylor', nan, 'adams', 'ringgold',
       'kossuth', 'woodbury', 'sac', 'monona', 'mahaska', 'buena vista',
       'appanoose', 'davis', 'hancock', 'calhoun', 'monroe', 'winneshiek',
       'fremont', 'obrien', 'pottawatta', 'buena vist', 'cerro gord'],
      dtype=object)

In [17]:
#this block of code makes changes to spelling differences of counties
cleaned_data.loc[(cleaned_data['County']=='obrien'),'County']="o'brien"
cleaned_data.loc[(cleaned_data['County']=='pottawatta'),'County']="pottawattamie"
cleaned_data.loc[(cleaned_data['County']=='buena vist'),'County']="buena vista"
cleaned_data.loc[(cleaned_data['County']=='cerro gord'),'County']="cerro gordo"

In [18]:
cleaned_data['County'].nunique() #number of unique county names in this column

99

In [19]:
#does the number of unique county names in our dataset equal the numer of counties in Iowa?
#note that this doesn't account for 'NaN' values for counties
print(99==cleaned_data['County'].nunique())

True

### Changing out NaN county Values to the correct county name

In [20]:
len(cleaned_data[cleaned_data['County'].isna()]) #this is the number of rows with no county info

72919

In [21]:
#what percent of our observations have null county values?
P=len(cleaned_data[cleaned_data['County'].isna()])/(len(cleaned_data[~cleaned_data['County'].isna()])+len(cleaned_data[cleaned_data['County'].isna()]))*100
print('{}% of the observations have null county vlaues'.format(P))

0.8634315956119739% of the observations have null county vlaues

In [22]:
#looked at the Store names for entries with null county values
cleaned_data[cleaned_data['County'].isna() & cleaned_data['City'].isna()].value_counts(subset='Store Name')

Store Name
Hy-Vee Food and Drug #6 / Cedar Rapids      362
New Star Liquor & Tobacco  / Ft Dodg        195
Hy-Vee Wine and Spirits / Estherville       187
Gameday Liquor                              127
Hy-Vee Drugstore / Council Bluffs           119
Liquor and Grocery Depot                     95
Casey's General Store #1548 / Ankeny         95
U S Gas                                      77
Kum & Go #502 / Iowa City                    67
Casey's General Store # 3508/ Marsha         66
Mmdg Spirits / Ames                          63
Casey's General Store #3075 / Ankeny         62
Kum & Go #4098 / Windsor Heights             62
Indy 66 West #929 / Indianola                51
North American Spirits                       50
Kum & Go #438 / Muscatine                    46
D And S Grocery                              43
Jeff's Market / Wilton                       42
Point Liquor & Tobacco                       38
Kum & Go # 119/ Northwood                    36
Kum & Go #201 / Coralville                   36
Fareway Stores #151 / Cedar Rapids           34
Kum & Go #521  /  Coralville                 32
Kum & Go #540 / Waukee                       29
The Secret Cellar                            26
AV Superstop                                 25
Express Mart                                 23
Fareway Stores #703 / Humbolt                21
Casey's General Store # 2417/ Newton         21
Fareway Store # 167/Johnston                 20
Casey's General Store # 2560                 19
Kum & Go #202 / 4th St Waukee                18
Casey's General Store #1680 / Adel           18
Casey's General Store #1567 / Anita          18
Casey's General Store #1365 / Paullina       17
Casey's General Store #1125 / Humest         16
Fas Mart # 5150/ Cedar Rapids                15
KUM & GO #83 / CASEY                         14
Casey's General Store #1617 / Jefferson      13
Casey's General Store #1493 / Van Meter      13
Casey's General Store # 2598/ Pella          12
Kum & Go #768 / Hospers                      11
River Mart                                   10
Casey's General Store # 2783/ Urband          9
Casey's General Store #1503 / Tabor           9
Kum & Go # 532/ West DSM                      7
Casey's General Store #1684 / Emmetsburg      6
dtype: int64

In [23]:
#had to look at entries where the county was entered and use that county name for the missing county names
#This is admitedly messy. If I had more time I would try to do a loop
cleaned_data.loc[(cleaned_data['Store Name']=='Fareway Stores #151 / Cedar Rapids'),'County']="linn"
cleaned_data.loc[(cleaned_data['Store Name']=='Kum & Go #521  /  Coralville'),'County']="johnson"
cleaned_data.loc[(cleaned_data['Store Name']=='Hy-Vee Food and Drug #6 / Cedar Rapids'),'County']="linn"
cleaned_data.loc[(cleaned_data['Store Name']=='New Star Liquor & Tobacco  / Ft Dodg'),'County']="webster"
cleaned_data.loc[(cleaned_data['Store Name']=='Hy-Vee Wine and Spirits / Estherville'),'County']="emmet"
cleaned_data.loc[(cleaned_data['Store Name']=='Gameday Liquor'),'County']="mills"
cleaned_data.loc[(cleaned_data['Store Name']=='Hy-Vee Drugstore / Council Bluffs'),'County']="pottawattamie"
cleaned_data.loc[(cleaned_data['Store Name']=='Liquor and Grocery Depot'),'County']="marshall"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1548 / Ankeny"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="U S Gas"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go #502 / Iowa City"),'County']="johnson"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store # 3508/ Marsha"),'County']="marshall"
cleaned_data.loc[(cleaned_data['Store Name']=="Mmdg Spirits / Ames"),'County']="story"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #3075 / Ankeny"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go #4098 / Windsor Heights"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="Indy 66 West #929 / Indianola"),'County']="warren"
cleaned_data.loc[(cleaned_data['Store Name']=="North American Spirits"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go #438 / Muscatine"),'County']="muscatine"
cleaned_data.loc[(cleaned_data['Store Name']=="D And S Grocery"),'County']="marion"
cleaned_data.loc[(cleaned_data['Store Name']=="Jeff's Market / Wilton"),'County']="muscatine"
cleaned_data.loc[(cleaned_data['Store Name']=="Point Liquor & Tobacco"),'County']="linn"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go # 119/ Northwood"),'County']="worth"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go #201 / Coralville"),'County']="johnson"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go #540 / Waukee"),'County']="dallas"
cleaned_data.loc[(cleaned_data['Store Name']=="The Secret Cellar"),'County']="johnson"
cleaned_data.loc[(cleaned_data['Store Name']=="AV Superstop"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="Express Mart"),'County']="muscatine"
cleaned_data.loc[(cleaned_data['Store Name']=="Fareway Stores #703 / Humbolt"),'County']="humboldt"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store # 2417/ Newton"),'County']="jasper"
cleaned_data.loc[(cleaned_data['Store Name']=="Fareway Store # 167/Johnston"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store # 2560"),'County']="story"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go #202 / 4th St Waukee"),'County']="dallas"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1680 / Adel"),'County']="dallas"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1567 / Anita"),'County']="cass"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1365 / Paullina"),'County']="o'brien"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1125 / Humest"),'County']="wayne"
cleaned_data.loc[(cleaned_data['Store Name']=="Fas Mart # 5150/ Cedar Rapids"),'County']="linn"
cleaned_data.loc[(cleaned_data['Store Name']=="KUM & GO #83 / CASEY"),'County']="guthrie"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1617 / Jefferson"),'County']="greene"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1493 / Van Meter"),'County']="dallas"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store # 2598/ Pella"),'County']="marion"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go #768 / Hospers"),'County']="sioux"
cleaned_data.loc[(cleaned_data['Store Name']=="River Mart"),'County']="des moines"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store # 2783/ Urband"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1503 / Tabor"),'County']="fremont"
cleaned_data.loc[(cleaned_data['Store Name']=="Kum & Go # 532/ West DSM"),'County']="polk"
cleaned_data.loc[(cleaned_data['Store Name']=="Casey's General Store #1684 / Emmetsburg"),'County']="palo alto"

In [24]:
len(cleaned_data)

8445255

In [25]:
#do the number of unique county names still match the actual number of Iowa counties (99?)
cleaned_data['County'].nunique() #we still have one more county name than there are Iowa counties, this is because of NaN counties

99

In [26]:
#THIS LOOKS FOR IF THERE ARE ANY NULL VALUES FOR COUNTY
len(cleaned_data[cleaned_data['County'].isna() & cleaned_data['City'].isna()].value_counts(subset='Store Name'))

0

### Remove all undesired columns

In [27]:
cleaned_data = cleaned_data.drop(columns=['Invoice/Item Number', 'Store Number', 'Store Name', 'Address', 'City', 
                                          'Store Location', 'Category', 'Category Name', 'Vendor Number', 'Vendor Name', 
                                         'Item Number', 'Item Description', 'Pack', 'Bottle Volume (ml)', 'State Bottle Cost', 
                                         'State Bottle Retail', 'Bottles Sold'])

### Some counties are in uppercase. We must normalize all county text to lowercase

In [28]:
cleaned_data['County'] = cleaned_data['County'].str.lower()

In [29]:
cleaned_data.head()

,Date,Zip Code,County Number,County,Sale (Dollars),Volume Sold (Liters),Volume Sold (Gallons)
6761203,2014-01-02,50125,91.0,warren,$20.39,0.75,0.20
5368674,2014-01-02,50312,77.0,polk,$44.97,2.25,0.59
3846964,2014-01-02,50315,77.0,polk,$16.79,1.00,0.26
2255583,2014-01-02,50111,77.0,polk,$21.74,0.75,0.20
5144101,2014-01-02,50321,77.0,polk,$71.40,3.00,0.79

### We want to aggregate on both the Sales and Volume columns. First, strip the dollar sign off the "Sale (Dollars)" column so we can convert the column values from string to float type

In [30]:
sales = [x.strip('$') for x in cleaned_data['Sale (Dollars)']] #removes '$' from all entries in this column

In [31]:
cleaned_data['Sales (Dollars)'] = sales

In [32]:
cleaned_data = cleaned_data.drop(columns=['Sale (Dollars)'])

In [33]:
cleaned_data['Sales (Dollars)'] = cleaned_data['Sales (Dollars)'].astype('float') #change data type of this column

### Aggregate total alcohol sales by date by county

In [34]:
daily_county_sales = cleaned_data.groupby(['Date','County'])['Sales (Dollars)'].sum()
daily_county_sales = daily_county_sales.reset_index()
daily_county_sales.to_csv('daily_county_sales.csv',index=False)
daily_county_sales

            Date      County  Sales (Dollars)
0     2014-01-02   allamakee           505.78
1     2014-01-02  black hawk        106479.37
2     2014-01-02       boone          4136.59
3     2014-01-02     carroll         29607.56
4     2014-01-02       cedar          4186.41
...          ...         ...              ...
30845 2017-10-31         sac          9744.54
30846 2017-10-31       sioux         20031.95
30847 2017-10-31      warren         20881.10
30848 2017-10-31     webster           989.62
30849 2017-10-31    woodbury          1054.48

[30850 rows x 3 columns]

### Aggregate total alcohol volume sold by date by county

In [35]:
daily_county_volume_l = cleaned_data.groupby(['Date','County'])['Volume Sold (Liters)'].sum()
daily_county_volume_l = daily_county_volume_l.reset_index()
daily_county_volume_l.to_csv('daily_county_volume_l.csv',index=False)
daily_county_volume_l

            Date      County  Volume Sold (Liters)
0     2014-01-02   allamakee                 38.75
1     2014-01-02  black hawk               7525.11
2     2014-01-02       boone                344.75
3     2014-01-02     carroll               2047.84
4     2014-01-02       cedar                289.57
...          ...         ...                   ...
30845 2017-10-31         sac                306.54
30846 2017-10-31       sioux                501.20
30847 2017-10-31      warren                414.57
30848 2017-10-31     webster                 55.50
30849 2017-10-31    woodbury                 10.63

[30850 rows x 3 columns]

### Aggregate total alcohol sales by month by county

In [36]:
monthly_county_sales = (cleaned_data.groupby([pd.Grouper(key='Date', freq='MS'), 'County'])['Sales (Dollars)'].sum())
monthly_county_sales = monthly_county_sales.reset_index()
monthly_county_sales.to_csv('monthly_county_sales.csv',index=False)
monthly_county_sales

           Date      County  Sales (Dollars)
0    2014-01-01       adair         29286.20
1    2014-01-01       adams          6631.54
2    2014-01-01   allamakee         47324.47
3    2014-01-01   appanoose         71855.44
4    2014-01-01     audubon         11627.08
...         ...         ...              ...
4541 2017-10-01   winnebago         43997.89
4542 2017-10-01  winneshiek         85934.71
4543 2017-10-01    woodbury        533066.44
4544 2017-10-01       worth         19501.38
4545 2017-10-01      wright         43305.26

[4546 rows x 3 columns]

### Aggregate total alcohol volume sold by month by county

In [37]:
monthly_county_volume_l = (cleaned_data.groupby([pd.Grouper(key='Date', freq='MS'), 'County'])['Volume Sold (Liters)'].sum())
monthly_county_volume_l = monthly_county_volume_l.reset_index()
monthly_county_volume_l.to_csv('monthly_county_volume_l.csv',index=False)
monthly_county_volume_l

           Date      County  Volume Sold (Liters)
0    2014-01-01       adair               2401.90
1    2014-01-01       adams                498.91
2    2014-01-01   allamakee               3923.81
3    2014-01-01   appanoose               6082.76
4    2014-01-01     audubon               1018.00
...         ...         ...                   ...
4541 2017-10-01   winnebago                813.46
4542 2017-10-01  winneshiek               1594.18
4543 2017-10-01    woodbury              10634.18
4544 2017-10-01       worth                589.33
4545 2017-10-01      wright               1167.53

[4546 rows x 3 columns]